wzurawski015/esp8266-event-driven/adapters/esp8266_rtos_sdk/components/ev_platform/ev_i2c_adapter.c
/*
 * Shared-bus timing policy:
 * - transaction timeout must tolerate one bounded OLED page-chunk transfer,
 * - mutex timeout must be longer than one command budget so slower bulk OLED
 *   flushes do not starve MCP23008/RTC access behind a too-aggressive bus lock
 *   window,
 * - runtime transactions never allocate heap memory; only the bootstrap mutex is
 *   allocated before the application runtime starts.
 */
static ev_i2c_status_t ev_esp8266_i2c_take_bus_with_timeout(TickType_t timeout_ticks)
{
    if (g_ev_i2c_bus_mutex == NULL) {
        return EV_I2C_ERR_BUS_LOCKED;
    }

    if (xSemaphoreTake(g_ev_i2c_bus_mutex, timeout_ticks) != pdTRUE) {
        return EV_I2C_ERR_TIMEOUT;
    }

    return EV_I2C_OK;
}

static ev_i2c_status_t ev_esp8266_i2c_take_bus(void)
{
    return ev_esp8266_i2c_take_bus_with_timeout(EV_ESP8266_I2C_MUTEX_TIMEOUT_TICKS);
}

static void ev_esp8266_i2c_give_bus(void)
{
    if (g_ev_i2c_bus_mutex != NULL) {
        (void)xSemaphoreGive(g_ev_i2c_bus_mutex);
    }
}

static ev_i2c_status_t ev_esp8266_i2c_begin_locked(ev_esp8266_i2c_adapter_ctx_t *adapter, int64_t *out_started_us)
{
    int64_t started_us;
    ev_i2c_status_t status;

    if ((adapter == NULL) || (out_started_us == NULL)) {
        return EV_I2C_ERR_BUS_LOCKED;
    }

    started_us = esp_timer_get_time();
    *out_started_us = started_us;

    status = ev_esp8266_i2c_prepare_bus(adapter, started_us);
    if (status == EV_I2C_OK) {
        ++adapter->transactions_started;
    }

    return status;
}

static ev_i2c_status_t ev_esp8266_i2c_finish_locked(ev_esp8266_i2c_adapter_ctx_t *adapter,
                                                    bool started,
                                                    int64_t started_us,
                                                    ev_i2c_status_t status)
{
    if (started) {
        const ev_i2c_status_t stop_status = ev_esp8266_i2c_stop_condition(adapter, started_us);
        if (status == EV_I2C_OK) {
            status = stop_status;
        }
    }

    ev_esp8266_i2c_release_bus_lines(adapter);
    return ev_esp8266_i2c_record_status(adapter, status);
}

static ev_i2c_status_t ev_esp8266_i2c_write_stream(void *ctx,
                                                    ev_i2c_port_num_t port_num,
                                                    uint8_t device_address_7bit,
                                                    const uint8_t *data,
                                                    size_t data_len)
{
    ev_esp8266_i2c_adapter_ctx_t *adapter = (ev_esp8266_i2c_adapter_ctx_t *)ctx;
    ev_i2c_status_t status;
    int64_t started_us = 0;
    bool started = false;

    if (!ev_esp8266_i2c_txn_is_valid(adapter, port_num, device_address_7bit)) {
        return EV_I2C_ERR_BUS_LOCKED;
    }
    if (((data_len > 0U) && (data == NULL)) || !ev_esp8266_i2c_payload_len_is_valid(data_len)) {
        return EV_I2C_ERR_BUS_LOCKED;
    }

    status = ev_esp8266_i2c_take_bus();
    if (status != EV_I2C_OK) {
        return ev_esp8266_i2c_record_status(adapter, status);
    }

    adapter->transaction_active = true;

    status = ev_esp8266_i2c_begin_locked(adapter, &started_us);
    if (status == EV_I2C_OK) {
        status = ev_esp8266_i2c_start_condition(adapter, started_us);
    }
    if (status == EV_I2C_OK) {
        started = true;
        status = ev_esp8266_i2c_write_byte(adapter, (uint8_t)((device_address_7bit << 1U) | 0U), started_us);
    }
    if ((status == EV_I2C_OK) && (data_len > 0U)) {
        status = ev_esp8266_i2c_write_payload(adapter, data, data_len, started_us);
    }

    status = ev_esp8266_i2c_finish_locked(adapter, started, started_us, status);
    adapter->transaction_active = false;
    ev_esp8266_i2c_give_bus();
    return status;
}

static ev_i2c_status_t ev_esp8266_i2c_write_regs(void *ctx,
                                                  ev_i2c_port_num_t port_num,
                                                  uint8_t device_address_7bit,
                                                  uint8_t first_reg,
                                                  const uint8_t *data,
                                                  size_t data_len)
{
    ev_esp8266_i2c_adapter_ctx_t *adapter = (ev_esp8266_i2c_adapter_ctx_t *)ctx;
    ev_i2c_status_t status;
    int64_t started_us = 0;
    bool started = false;

    if (!ev_esp8266_i2c_txn_is_valid(adapter, port_num, device_address_7bit)) {
        return EV_I2C_ERR_BUS_LOCKED;
    }
    if (((data_len > 0U) && (data == NULL)) || !ev_esp8266_i2c_payload_len_is_valid(data_len)) {
        return EV_I2C_ERR_BUS_LOCKED;
    }

    status = ev_esp8266_i2c_take_bus();
    if (status != EV_I2C_OK) {
        return ev_esp8266_i2c_record_status(adapter, status);
    }

    adapter->transaction_active = true;

    status = ev_esp8266_i2c_begin_locked(adapter, &started_us);
    if (status == EV_I2C_OK) {
        status = ev_esp8266_i2c_start_condition(adapter, started_us);
    }
    if (status == EV_I2C_OK) {
        started = true;
        status = ev_esp8266_i2c_write_byte(adapter, (uint8_t)((device_address_7bit << 1U) | 0U), started_us);
    }
    if (status == EV_I2C_OK) {
        status = ev_esp8266_i2c_write_byte(adapter, first_reg, started_us);
    }
    if ((status == EV_I2C_OK) && (data_len > 0U)) {
        status = ev_esp8266_i2c_write_payload(adapter, data, data_len, started_us);
    }

    status = ev_esp8266_i2c_finish_locked(adapter, started, started_us, status);
    adapter->transaction_active = false;
    ev_esp8266_i2c_give_bus();
    return status;
}

static ev_i2c_status_t ev_esp8266_i2c_read_regs(void *ctx,
                                                 ev_i2c_port_num_t port_num,
                                                 uint8_t device_address_7bit,
                                                 uint8_t first_reg,
                                                 uint8_t *data,
                                                 size_t data_len)
{
    ev_esp8266_i2c_adapter_ctx_t *adapter = (ev_esp8266_i2c_adapter_ctx_t *)ctx;
    ev_i2c_status_t status;
    int64_t started_us = 0;
    size_t offset;
    bool started = false;

    if (!ev_esp8266_i2c_txn_is_valid(adapter, port_num, device_address_7bit)) {
        return EV_I2C_ERR_BUS_LOCKED;
    }
    if ((data == NULL) || (data_len == 0U) || !ev_esp8266_i2c_payload_len_is_valid(data_len)) {
        return EV_I2C_ERR_BUS_LOCKED;
    }

