wzurawski015/esp8266-event-driven/adapters/esp8266_rtos_sdk/components/ev_platform/ev_i2c_adapter.c
    status = ev_esp8266_i2c_take_bus();
    if (status != EV_I2C_OK) {
        return ev_esp8266_i2c_record_status(adapter, status);
    }

    adapter->transaction_active = true;

    status = ev_esp8266_i2c_begin_locked(adapter, &started_us);
    if (status == EV_I2C_OK) {
        status = ev_esp8266_i2c_start_condition(adapter, started_us);
    }
    if (status == EV_I2C_OK) {
        started = true;
        status = ev_esp8266_i2c_write_byte(adapter, (uint8_t)((device_address_7bit << 1U) | 0U), started_us);
    }
    if (status == EV_I2C_OK) {
        status = ev_esp8266_i2c_write_byte(adapter, first_reg, started_us);
    }
    if (status == EV_I2C_OK) {
        status = ev_esp8266_i2c_start_condition(adapter, started_us);
    }
    if (status == EV_I2C_OK) {
        status = ev_esp8266_i2c_write_byte(adapter, (uint8_t)((device_address_7bit << 1U) | 1U), started_us);
    }

    for (offset = 0U; (status == EV_I2C_OK) && (offset < data_len); ++offset) {
        const bool ack_after_byte = (offset + 1U) < data_len;
        status = ev_esp8266_i2c_read_byte(adapter, &data[offset], ack_after_byte, started_us);
    }

    status = ev_esp8266_i2c_finish_locked(adapter, started, started_us, status);
    adapter->transaction_active = false;
    ev_esp8266_i2c_give_bus();
    return status;
}

static const char *ev_esp8266_i2c_known_device_name(uint8_t device_address_7bit)
{
    if (device_address_7bit == 0x68U) {
        return "rtc";
    }
    if ((device_address_7bit >= 0x20U) && (device_address_7bit <= 0x27U)) {
        return "mcp23008";
    }
    if ((device_address_7bit == 0x3CU) || (device_address_7bit == 0x3DU)) {
        return "oled";
    }
    return NULL;
}

static ev_esp8266_i2c_adapter_ctx_t *ev_esp8266_i2c_ctx_from_port(ev_i2c_port_num_t port_num)
{
    if (port_num == EV_I2C_PORT_NUM_0) {
        return &g_ev_i2c0_ctx;
    }
    return NULL;
}

ev_result_t ev_i2c_scan(ev_i2c_port_num_t port_num)
{
    ev_esp8266_i2c_adapter_ctx_t *ctx = ev_esp8266_i2c_ctx_from_port(port_num);
    bool found_any = false;
    bool found_rtc = false;
    bool found_oled = false;
    bool found_mcp = false;
    uint8_t device_address_7bit;

    if (ctx == NULL) {
        return EV_ERR_UNSUPPORTED;
    }
    if (!ctx->configured) {
        return EV_ERR_STATE;
    }

    ESP_LOGI(k_ev_i2c_tag,
             "i2c-scan: start port=%u SDA=%d SCL=%d",
             (unsigned)port_num,
             ctx->sda_pin,
             ctx->scl_pin);

    for (device_address_7bit = 0x03U; device_address_7bit < 0x78U; ++device_address_7bit) {
        ev_i2c_status_t status = ev_esp8266_i2c_write_stream(ctx, port_num, device_address_7bit, NULL, 0U);

        if (status == EV_I2C_OK) {
            const char *device_name = ev_esp8266_i2c_known_device_name(device_address_7bit);
            found_any = true;

            if (device_address_7bit == 0x68U) {
                found_rtc = true;
            }
            if ((device_address_7bit >= 0x20U) && (device_address_7bit <= 0x27U)) {
                found_mcp = true;
            }
            if ((device_address_7bit == 0x3CU) || (device_address_7bit == 0x3DU)) {
                found_oled = true;
            }

            if (device_name != NULL) {
                ESP_LOGI(k_ev_i2c_tag,
                         "i2c-scan: found 0x%02X (%s)",
                         (unsigned)device_address_7bit,
                         device_name);
            } else {
                ESP_LOGI(k_ev_i2c_tag, "i2c-scan: found 0x%02X", (unsigned)device_address_7bit);
            }
        }
    }

    if (!found_any) {
        ESP_LOGW(k_ev_i2c_tag, "i2c-scan: no devices acknowledged");
    }
    if (found_rtc) {
        ESP_LOGI(k_ev_i2c_tag, "rtc-probe: detected device at 0x68");
    } else {
        ESP_LOGW(k_ev_i2c_tag, "rtc-probe: no response at 0x68");
    }
    if (found_mcp) {
        ESP_LOGI(k_ev_i2c_tag, "mcp23008-probe: detected device in range 0x20-0x27");
    } else {
        ESP_LOGW(k_ev_i2c_tag, "mcp23008-probe: no response in range 0x20-0x27");
    }
    if (found_oled) {
        ESP_LOGI(k_ev_i2c_tag, "oled-probe: detected device at 0x3C or 0x3D");
    } else {
        ESP_LOGI(k_ev_i2c_tag, "oled-probe: optional OLED not detected");
    }

    return EV_OK;
}


ev_result_t ev_esp8266_i2c_get_diag(ev_i2c_port_num_t port_num, ev_esp8266_i2c_diag_snapshot_t *out_snapshot)
{
    ev_esp8266_i2c_adapter_ctx_t *ctx = ev_esp8266_i2c_ctx_from_port(port_num);

    if (out_snapshot == NULL) {
        return EV_ERR_INVALID_ARG;
    }
    if ((ctx == NULL) || !ctx->configured) {
        return EV_ERR_STATE;
    }

    out_snapshot->transactions_started = ctx->transactions_started;
    out_snapshot->transactions_failed = ctx->transactions_failed;
    out_snapshot->nacks = ctx->nacks;
    out_snapshot->timeouts = ctx->timeouts;
    out_snapshot->bus_locked = ctx->bus_locked;
    out_snapshot->bus_recoveries = ctx->bus_recoveries;
    out_snapshot->bus_recovery_failures = ctx->bus_recovery_failures;
    out_snapshot->sleep_prepare_attempts = ctx->sleep_prepare_attempts;
    out_snapshot->sleep_prepare_failures = ctx->sleep_prepare_failures;
    out_snapshot->transaction_active = ctx->transaction_active;
    out_snapshot->sda_high = ev_esp8266_i2c_sample_sda(ctx);
    out_snapshot->scl_high = ev_esp8266_i2c_sample_scl(ctx);
    return EV_OK;
}
ev_result_t ev_esp8266_i2c_prepare_for_sleep(ev_i2c_port_num_t port_num)
{
    ev_esp8266_i2c_adapter_ctx_t *ctx = ev_esp8266_i2c_ctx_from_port(port_num);
    ev_i2c_status_t status;
    int64_t started_us;

    if ((ctx == NULL) || !ctx->configured) {
        return EV_ERR_STATE;
    }

    ++ctx->sleep_prepare_attempts;
    if (ctx->transaction_active) {
        ++ctx->sleep_prepare_failures;
        return EV_ERR_STATE;
    }

    status = ev_esp8266_i2c_take_bus_with_timeout(0);
    if (status != EV_I2C_OK) {
        ++ctx->sleep_prepare_failures;
        (void)ev_esp8266_i2c_record_status(ctx, status);
        return EV_ERR_STATE;
    }

    if (ctx->transaction_active) {
        ++ctx->sleep_prepare_failures;
        ev_esp8266_i2c_give_bus();
        return EV_ERR_STATE;
    }

